Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Are you sure you want to delete this connection? This cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette connexion ? Cela ne peut pas être annulé.
ko: 이 연결을 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
tr: Bu bağlantıyı silmek istediğinize emin misiniz? Bu işlem geri alınamaz.
vi: Bạn có chắc muốn xóa kết nối này? Thao tác này không thể hoàn tác.
zh_hans: 确定要删除此连接吗？此操作无法撤消。
zh_hant: 確定要刪除此連線嗎？此操作無法復原。

source: Sentinel Nodes
fr: Nœuds de sentinelle
ko: 센티널 노드
tr: Sentinel Düğümleri
vi: Nút Sentinel
zh_hans: 哨兵节点
zh_hant: 哨兵節點

source: less-than sign
fr: Signe de moins
ko: 보다 작음 기호
tr: küçüktür işareti
vi: dấu nhỏ hơn
zh_hans: 小于号
zh_hant: 小於號

source: Resume
fr: Curriculum vitae
ko: 재개
tr: Devam Et
vi: Tiếp tục
zh_hans: 继续
zh_hant: 繼續

source: Transfer Tables
fr: Tables de transfert

source: Background
fr: Arrière-plan
ko: 배경
tr: Arka Plan
vi: Nền
zh_hans: 背景
zh_hant: 背景

source: Run against this schema (uses current if omitted)
fr: Exécutez contre ce schéma (utilise le présent si omis)
ko: 이 스키마에서 실행(생략 시 현재 스키마 사용)
tr: Bu şemada çalıştır (belirtilmezse geçerli olan kullanılır)
vi: Chạy trên schema này (bỏ trống thì dùng cái hiện tại)
zh_hans: 在此 Schema 上运行（省略则使用当前 Schema）
zh_hant: 在此綱要上執行（省略則使用目前的綱要）

source: iCloud Connected
fr: iCloud connecté
ko: iCloud 연결됨
tr: iCloud Bağlı
vi: Đã kết nối iCloud
zh_hans: iCloud 已连接
zh_hant: iCloud 已連線

source: less or equal
fr: Moins ou égal
ko: 작거나 같음
tr: küçük veya eşit
vi: nhỏ hơn hoặc bằng
zh_hans: 小于或等于
zh_hant: 小於或等於

source: Move Line Up
fr: Déplacer la ligne d'alignement
ko: 줄을 위로 이동
tr: Satırı Yukarı Taşı
vi: Chuyển dòng lên
zh_hans: 上移一行
zh_hant: 將該行上移

source: Failed to generate TLS certificate
fr: Échec de la génération du certificat TLS
ko: TLS 인증서를 생성하지 못했습니다
tr: TLS sertifikası oluşturulamadı
vi: Không tạo được chứng chỉ TLS
zh_hans: 生成 TLS 证书失败
zh_hant: 產生 TLS 憑證失敗

# Delete row %@ from %@
source: Delete row %1$@ from %2$@
fr: Supprimer la ligne %1$@ de %2$@
ko: %2$@에서 행 %1$@ 삭제
tr: %2$@ içinden %1$@ satırını sil
vi: Xóa dòng %1$@ khỏi %2$@
zh_hans: 从 %2$@ 删除行 %1$@
zh_hant: 從 %2$@ 刪除列 %1$@

source: Schema that was dropped
fr: Schéma qui a été abandonné
ko: 삭제된 스키마
tr: Silinen şema
vi: Schema đã bị xoá
zh_hans: 已删除的 Schema
zh_hant: 已刪除的綱要

source: Move the connection's browse cursor to another database. This changes what the user sees in TablePro. To run one statement elsewhere, pass 'database' to that tool instead.
fr: Déplacez le curseur de navigation de la connexion vers une autre base de données. Cela modifie ce que l'utilisateur voit dans TablePro. Pour exécuter une instruction ailleurs, passez plutôt 'base de données' à cet outil.
ko: 연결의 탐색 위치를 다른 데이터베이스로 옮깁니다. 사용자가 TablePro에서 보는 내용이 바뀝니다. 한 개의 명령문만 다른 곳에서 실행하려면 해당 도구에 'database'를 전달하십시오.
tr: Bağlantının gezinme imlecini başka bir veritabanına taşır. Bu, kullanıcının TablePro'da gördüğünü değiştirir. Tek bir ifadeyi başka yerde çalıştırmak için bunun yerine ilgili araca 'database' geçirin.
vi: Chuyển con trỏ duyệt của kết nối sang một cơ sở dữ liệu khác. Điều này thay đổi những gì người dùng thấy trong TablePro. Để chạy một câu lệnh ở nơi khác, hãy truyền 'database' cho công cụ đó thay vì dùng cách này.
zh_hans: 把连接的浏览位置切换到另一个数据库。这会改变用户在 TablePro 中看到的内容。若只想在别处运行一条语句，请改为向那个工具传入 'database'。
zh_hant: 把連線的瀏覽位置切換到另一個資料庫。這會改變使用者在 TablePro 中看到的內容。若只想在別處執行一條陳述式，請改為向那個工具傳入 'database'。

source: Navigating to another page will discard all unsaved changes.
fr: La navigation vers une autre page supprimera toutes les modifications non enregistrées.
ko: 다른 페이지로 이동하면 저장하지 않은 모든 변경 사항이 폐기됩니다.
tr: Başka bir sayfaya gitmek kaydedilmemiş değişiklikleri siler.
vi: Chuyển sang trang khác sẽ huỷ tất cả thay đổi chưa lưu.
zh_hans: 导航到其他页面将丢弃所有未保存的更改。
zh_hant: 前往其他頁面將捨棄所有未儲存的變更。

source: Not supported for this database.
fr: Pas pris en charge pour cette base de données.
ko: 이 데이터베이스에서는 지원되지 않습니다.
tr: Bu veritabanında desteklenmiyor.
vi: Không hỗ trợ cho cơ sở dữ liệu này.
zh_hans: 此数据库不支持。
zh_hant: 此資料庫不支援。

source: This element is not valid JSON
fr: Cet élément n'est pas un JSON valide.

source: First %@
fr: Premier %@

source: Open Query from Link
fr: Ouvrir une requête à partir d'un lien
ko: 링크에서 쿼리 열기
tr: Linkten Sorgu Aç
vi: Mở truy vấn từ liên kết
zh_hans: 从链接打开查询
zh_hant: 從連結開啟查詢

source: Read-only SQL over Iceberg tables in R2
fr: SQL en lecture seule sur les tables Iceberg dans R2

source: Pink
fr: Rose
ko: 분홍색
tr: Pembe
vi: Hồng
zh_hans: 粉色
zh_hant: 粉紅色

source: Status: expired
fr: Statut : expiré
ko: 상태: 만료됨
tr: Durum: süresi dolmuş
vi: Trạng thái: đã hết hạn
zh_hans: 状态：已过期
zh_hant: 狀態：已過期

source: Claude Code is not installed.
fr: Le code Claude n'est pas installé.
ko: Claude Code가 설치되어 있지 않습니다.
tr: Claude Code yüklü değil.
vi: Claude Code chưa được cài đặt.
zh_hans: 尚未安装 Claude Code。
zh_hant: 尚未安裝 Claude Code。

source: Filter Values…
fr: Filtrer les valeurs...
ko: 값 필터링…
tr: Değerleri Filtrele…
vi: Lọc giá trị…
zh_hans: 筛选值…
zh_hant: 篩選值…

source: Timed out completing Kerberos authentication. The Kerberos KDC (domain controller) may be unreachable, the server's SPN may be missing, or this device's clock may be off. Check your network to the domain, or use SQL Server Authentication.
fr: Temps d'attente écoulé pour terminer l'authentification Kerberos. Le KDC Kerberos (contrôleur de domaine) peut ne pas être joignable, le SPN du serveur peut être manquant ou l'horloge de cet appareil peut être défectueuse. Vérifiez votre réseau vers le domaine ou utilisez l'authentification SQL Server.
ko: Kerberos 인증을 완료하는 동안 시간이 초과되었습니다. Kerberos KDC(도메인 컨트롤러)에 연결할 수 없거나, 서버의 SPN이 없거나, 이 기기의 시계가 맞지 않을 수 있습니다. 도메인에 대한 네트워크 연결을 확인하거나 SQL Server 인증을 사용하십시오.
tr: Kerberos kimlik doğrulaması zaman aşımına uğradı. Kerberos KDC'si (etki alanı denetleyicisi) erişilemez olabilir, sunucunun SPN'i eksik olabilir ya da bu cihazın saati kaymış olabilir. Etki alanına ağ bağlantınızı kontrol edin veya SQL Server Kimlik Doğrulaması'nı kullanın.
vi: Hết thời gian chờ khi hoàn tất xác thực Kerberos. Có thể KDC Kerberos (domain controller) không truy cập được, SPN của máy chủ bị thiếu, hoặc đồng hồ của thiết bị này bị lệch. Hãy kiểm tra mạng tới domain, hoặc dùng SQL Server Authentication.
zh_hans: 完成 Kerberos 认证超时。可能是 Kerberos KDC（域控制器）无法访问、服务器的 SPN 缺失，或本设备的时钟不准。请检查到域的网络，或改用 SQL Server 身份验证。
zh_hant: 完成 Kerberos 驗證逾時。可能是 Kerberos KDC（網域控制站）無法連線、伺服器的 SPN 遺失，或本裝置的時鐘不準。請檢查到網域的網路，或改用 SQL Server 驗證。

source: Could not fetch plugin registry
fr: Impossible de récupérer le registre des plugins.
ko: 플러그인 레지스트리를 가져올 수 없습니다
tr: Eklenti kaydı alınamadı
vi: Không thể tải danh sách plugin
zh_hans: 无法获取插件注册表
zh_hant: 無法取得外掛註冊

source: Import into
fr: Importer dans

source: %@ · You
fr: %@ · Vous
ko: %@ · 나
tr: %@ · Siz
vi: %@ · Bạn
zh_hans: %@ · 你
zh_hant: %@ · 你

source: A system table
fr: Une table de système

source: Close the open Sample connection before resetting it.
fr: Fermer la connexion d'échantillon ouverte avant de la réinitialiser.
ko: 재설정하기 전에 열려 있는 Sample 연결을 닫으십시오.
tr: Sıfırlamadan önce açık olan Örnek bağlantısını kapatın.
vi: Đóng kết nối Mẫu đang mở trước khi đặt lại.
zh_hans: 重置前请先关闭已打开的示例连接。
zh_hant: 重設前請先關閉已開啟的範例連線。

source: “%@” will be permanently deleted. External clients using this token will lose access immediately.
fr: «%@» sera supprimé définitivement. Les clients externes utilisant ce jeton perdront immédiatement l’accès.
ko: “%@” 항목이 영구적으로 삭제됩니다. 이 토큰을 사용하는 외부 클라이언트는 즉시 접근 권한을 잃습니다.
tr: "%@" kalıcı olarak silinecek. Bu token'ı kullanan harici istemciler erişimi anında kaybedecek.
vi: “%@” sẽ bị xóa vĩnh viễn. Các client bên ngoài đang dùng token này sẽ mất quyền truy cập ngay lập tức.
zh_hans: “%@” 将被永久删除。使用此令牌的外部客户端将立即失去访问权限。
zh_hant: 「%@」將會永久刪除。使用此權杖的外部用戶端將立即失去存取權限。

source: Timed out during the Oracle login handshake. The server accepted the network connection but did not finish logging in.
fr: Délai d'expiration pendant la poignée de main de connexion Oracle. Le serveur a accepté la connexion réseau, mais n'a pas terminé la connexion.
ko: Oracle 로그인 핸드셰이크 중 시간이 초과되었습니다. 서버가 네트워크 연결을 수락했지만 로그인을 완료하지 않았습니다.
tr: Oracle oturum açma el sıkışması sırasında zaman aşımı oluştu. Sunucu ağ bağlantısını kabul etti ama oturum açmayı tamamlamadı.
vi: Hết thời gian chờ trong quá trình bắt tay đăng nhập Oracle. Máy chủ đã chấp nhận kết nối mạng nhưng không hoàn tất đăng nhập.
zh_hans: Oracle 登录握手超时。服务器接受了网络连接，但没有完成登录。
zh_hant: Oracle 登入交握逾時。伺服器接受了網路連線，但沒有完成登入。

source: %@ rows copied
fr: %@ lignes copiées

source: Default view:
fr: Vue par défaut :
ko: 기본 보기:
tr: Varsayılan görünüm:
vi: Chế độ xem mặc định:
zh_hans: 默认视图：
zh_hant: 預設檢視：

source: Fields
fr: Campagnes
ko: 필드
tr: Alanlar
vi: Trường
zh_hans: 字段
zh_hant: 欄位

source: Could Not Open File
fr: Impossible d'ouvrir le fichier
ko: 파일을 열 수 없음
tr: Dosya Açılamadı
vi: Không thể mở tệp
zh_hans: 无法打开文件
zh_hant: 無法開啟檔案

source: left curly bracket
fr: Braceau croisé gauche
ko: 여는 중괄호
tr: sol süslü parantez
vi: dấu ngoặc nhọn mở
zh_hans: 左花括号
zh_hant: 左大括號

source: Key %@ was not found in the secret JSON.
fr: La clé %@ n'a pas été trouvée dans le JSON secret.
ko: 비밀 JSON에서 %@ 키를 찾을 수 없습니다.
tr: %@ anahtarı secret JSON içinde bulunamadı.
vi: Không tìm thấy khóa %@ trong JSON secret.
zh_hans: 在 secret JSON 中未找到键 %@。
zh_hant: 在 secret JSON 中找不到鍵 %@。

source: Engine (e.g., InnoDB)
fr: Moteur (par exemple, InnoDB)
ko: 엔진(예: InnoDB)
tr: Motor (örn. InnoDB)
vi: Engine (vd: InnoDB)
zh_hans: Engine（如 InnoDB）
zh_hant: Engine（例如 InnoDB）

source: Renew License…
fr: Renouveler la licence...
ko: 라이선스 갱신…
tr: Lisansı Yenile…
vi: Gia hạn giấy phép…
zh_hans: 续期许可证…
zh_hant: 續訂授權…

source: Preset Name
fr: Nom prédefini
ko: 프리셋 이름
tr: Ön Ayar Adı
vi: Tên mẫu đặt trước
zh_hans: 预设名称
zh_hant: 預設集名稱

source: Inspector
fr: Inspecteur
ko: 인스펙터
tr: Denetçi
vi: Thanh kiểm tra
zh_hans: 检查器
zh_hant: 檢閱器

source: Explain variants this engine declares
fr: Expliquez les variantes que ce moteur déclare
ko: 이 엔진이 선언하는 EXPLAIN 변형
tr: Bu motorun bildirdiği açıklama varyantları
vi: Các biến thể EXPLAIN mà engine này khai báo
zh_hans: 此引擎声明的 EXPLAIN 变体
zh_hant: 此引擎宣告的 EXPLAIN 變體

source: This foreign key needs a referenced table.
fr: Cette clé étrangère nécessite une table référencée.

source: Connections found in %@
fr: Connections trouvées dans %@
ko: %@에서 찾은 연결
tr: %@ içinde bulunan bağlantılar
vi: Các kết nối tìm thấy trong %@
zh_hans: 在 %@ 中找到的连接
zh_hant: 在 %@ 中找到的連線

source: Empty
fr: Vide
ko: 비어 있음
tr: Boş
vi: Trống
zh_hans: 空
zh_hant: 空白

source: Could Not Compare
fr: Impossible de comparer
ko: 비교할 수 없음
tr: Karşılaştırılamadı
vi: Không thể so sánh
zh_hans: 无法比较
zh_hant: 無法比較

source: Could Not Open Query
fr: Impossible d'ouvrir la requête
ko: 쿼리를 열 수 없음
tr: Sorgu Açılamadı
vi: Không thể mở truy vấn
zh_hans: 无法打开查询
zh_hant: 無法開啟查詢

source: Generate Token
fr: Générer un jeton
ko: 토큰 생성
tr: Token Oluştur
vi: Tạo token
zh_hans: 生成令牌
zh_hant: 產生權杖

source: %@ cannot have constraints.
fr: %@ ne peut pas avoir de contraintes.

source: Saving Changes…
fr: Enregistrement des modifications...

source: Return size, engine, collation, and timestamps the engine records for one table.
fr: Retourne la taille, le moteur, la collation et les tampons de temps que le moteur enregistre pour une table.
ko: 엔진이 한 테이블에 대해 기록하는 크기, 엔진, 콜레이션, 타임스탬프를 반환합니다.
tr: Motorun bir tablo için kaydettiği boyutu, motoru, karşılaştırma kuralını ve zaman damgalarını döndürür.
vi: Trả về kích thước, engine, collation và các dấu thời gian mà engine ghi lại cho một bảng.
zh_hans: 返回引擎为某张表记录的大小、引擎、排序规则和时间戳。
zh_hant: 回傳引擎為某張資料表記錄的大小、引擎、定序和時間戳記。

source: Copy Key
fr: Clé de copie
ko: 키 복사
tr: Anahtarı Kopyala
vi: Sao chép khoá
zh_hans: 复制键
zh_hant: 複製鍵

source: Save or discard the pending structure changes before reordering columns.
fr: Sauvegardez ou rejetez les changements de structure en attente avant de réorganiser les colonnes.

source: One SQL or NoSQL statement, or a SQL Server script
fr: Une seule instruction SQL ou NoSQL, ou un script SQL Server.

source: Reset All Settings
fr: Réinitialiser toutes les paramètres
ko: 모든 설정 재설정
tr: Tüm Ayarları Sıfırla
vi: Đặt lại tất cả cài đặt
zh_hans: 重置所有设置
zh_hant: 重設所有設定

source: Cannot save schema changes: TablePro's Safe Mode is set to read-only for this connection.
fr: Impossible d'enregistrer les modifications du schéma : le mode sécurisé de TablePro est réglé en lecture seule pour cette connexion.
ko: 스키마 변경 사항을 저장할 수 없습니다. 이 연결에 대한 TablePro의 안전 모드가 읽기 전용으로 설정되어 있습니다.
tr: Şema değişiklikleri kaydedilemiyor: Bu bağlantı için TablePro'nun Safe Mode ayarı salt okunur.
vi: Không thể lưu thay đổi schema: Chế độ an toàn của TablePro đang đặt kết nối này ở chế độ chỉ đọc.
zh_hans: 无法保存 Schema 更改：TablePro 的安全模式已将此连接设为只读。
zh_hant: 無法儲存綱要變更：TablePro 的安全模式已將此連線設為唯讀。

source: Holds a command that forwards a local port, such as kubectl port-forward.
fr: Contient une commande qui renvoie un port local, tel que kubectl port-forward.

source: Status: revoked
fr: Statut : révoqué
ko: 상태: 철회됨
tr: Durum: iptal edildi
vi: Trạng thái: đã thu hồi
zh_hans: 状态：已撤销
zh_hant: 狀態：已撤銷

source: Move Group to…
fr: Déplacer le groupe vers...
ko: 그룹 이동…
tr: Grubu Taşı…
vi: Di chuyển nhóm đến…
zh_hans: 移动分组到…
zh_hant: 移動群組至…

source: Filter column: %@
fr: Colonne de filtrage : %@
ko: 열 필터링: %@
tr: Filtre sütunu: %@
vi: Cột lọc: %@
zh_hans: 筛选列: %@
zh_hant: 篩選欄位：%@

source: Reset to System Default
fr: Réinitialiser à la valeur par défaut du système
ko: 시스템 기본값으로 재설정
tr: Sistem Varsayılanına Sıfırla
vi: Đặt lại về mặc định hệ thống
zh_hans: 重置为系统默认
zh_hant: 重設為系統預設值

source: Title 2
fr: Titre 2
ko: 제목 2
vi: Tiêu đề 2
zh_hans: 标题 2
zh_hant: 標題 2

source: Saved Queries
fr: Requêtes enregistrées
ko: 저장된 쿼리
tr: Kayıtlı Sorgular
vi: Truy vấn đã lưu
zh_hans: 已保存的查询
zh_hant: 已儲存的查詢

source: SQL Server counts most emoji as two characters toward an NVARCHAR length, so a value that fills its length with them is refused.
fr: SQL Server compte la plupart des emojis comme deux caractères vers une longueur NVARCHAR, donc une valeur qui remplit sa longueur avec eux est refusée.

source: DynamoDB Local (no credentials)
fr: DynamoDB Local (pas de coordonnées)

# Row %d, column %d: %@
source: Row %1$d, column %2$d: %3$@
fr: Rang %1$d, colonne %2$d : %3$@
ko: %1$d행, %2$d열: %3$@
tr: Satır %d, sütun %d: %@
vi: Dòng %d, cột %d: %@
zh_hans: 第%d行，第%d列：%@
zh_hant: 第 %1$d 列，第 %2$d 欄：%3$@

source: %d filters applied
fr: %d filtres appliqués
ko: 필터 %d개 적용됨
tr: %d filtre uygulandı
vi: Đã áp dụng %d bộ lọc
zh_hans: 已应用 %d 个筛选条件
zh_hant: 已套用 %d 個篩選條件

source: A domain's base type, or a range's subtype
fr: Le type de base d'un domaine, ou le sous-type d'une plage.

source: Your favorite tables are in other %@. Switch to one to see them here.
fr: Vos tables préférées se trouvent dans d'autres %@. Changez-en une pour les voir ici.

source: License expired, sync paused
fr: Licence expirée, synchronisation suspendue
ko: 라이선스 만료, 동기화 일시 정지
tr: Lisansın süresi doldu, eşitleme duraklatıldı
vi: Giấy phép đã hết hạn, đồng bộ tạm dừng
zh_hans: 许可证已过期，同步已暂停
zh_hant: 授權已過期，同步已暫停

source: %@, staged
fr: %@, scénarisé

source: A view
fr: Une vue

# Index %@ matches %@ on the target but the names differ.
source: Index %1$@ matches %2$@ on the target but the names differ.
fr: L'indice %1$@ correspond à %2$@ sur la cible, mais les noms diffèrent.
ko: 인덱스 %@은(는) 대상의 %@과(와) 일치하지만 이름이 다릅니다.
tr: %1$@ indeksi hedefteki %2$@ ile eşleşiyor ama adları farklı.
vi: Chỉ mục %1$@ khớp với %2$@ trên đích nhưng tên khác nhau.
zh_hans: 索引 %1$@ 与目标上的 %2$@ 相同，但名称不同。
zh_hant: 索引 %1$@ 與目標上的 %2$@ 相同，但名稱不同。

source: Copy Name
fr: Copier le nom
ko: 이름 복사
tr: Adı Kopyala
vi: Sao chép tên
zh_hans: 复制名称
zh_hant: 複製名稱

source: Looks like a placeholder value
fr: On dirait une valeur de remplacement.
ko: 자리표시자 값인 것 같습니다
tr: Yer tutucu bir değere benziyor
vi: Trông giống giá trị mẫu
zh_hans: 看起来是占位值
zh_hant: 看起來是預留位置值

source: Copied to clipboard
fr: Copié dans le presse-papiers
ko: 클립보드에 복사됨
tr: Panoya kopyalandı
vi: Đã sao chép
zh_hans: 已复制到剪贴板
zh_hant: 已複製到剪貼簿

source: Copy Qualified Name
fr: Copier le nom qualifié

source: Another profile already has this name.
fr: Un autre profil a déjà ce nom.

source: Drop a whole database or a whole schema. This deletes everything inside it and cannot be undone, so the user approves it first. Needs tools:write on a connection left writable for external clients.
fr: Déposez une toute nouvelle base de données ou un tout nouveau schéma. Cela supprime tout ce qui y est contenu et ne peut pas être annulé, donc l'utilisateur doit l'approuver d'abord. Nécessite des outils : écrire sur une connexion laissée écrite pour les clients externes.
ko: 데이터베이스 또는 스키마 전체를 삭제합니다. 내부의 모든 것이 지워지고 되돌릴 수 없으므로 사용자가 먼저 승인합니다. 외부 클라이언트에 쓰기가 허용된 연결에서 tools:write가 필요합니다.
tr: Bir veritabanının veya şemanın tamamını siler. İçindeki her şeyi siler ve geri alınamaz, bu yüzden önce kullanıcı onaylar. Dış istemcilere yazılabilir bırakılmış bir bağlantıda tools:write gerektirir.
vi: Xoá toàn bộ một cơ sở dữ liệu hoặc một schema. Thao tác này xoá mọi thứ bên trong và không thể hoàn tác, nên người dùng phải phê duyệt trước. Cần tools:write trên một kết nối được để ghi cho client bên ngoài.
zh_hans: 删除整个数据库或整个 Schema。这会删除其中的一切且无法撤销，因此需要用户先行批准。需要在对外部客户端可写的连接上具备 tools:write。
zh_hant: 刪除整個資料庫或整個綱要。這會刪除其中的一切且無法還原，因此需要使用者先行核准。需要在對外部用戶端可寫入的連線上具備 tools:write。

source: Extend Selection to Next Statement
fr: Prolonger la sélection à la prochaine déclaration
ko: 다음 문까지 선택 확장
tr: Seçimi Sonraki İfadeye Genişlet
vi: Mở rộng vùng chọn đến câu lệnh tiếp theo
zh_hans: 将所选内容扩展到下一条语句
zh_hant: 將所選範圍延伸至下一個陳述式

source: Shadows the SQL keyword '%@'
fr: Ombre la clé de recherche SQL '%@'
ko: SQL 키워드 '%@'와 이름이 겹칩니다
tr: '%@' SQL anahtar sözcüğünü gölgeliyor
vi: Trùng với từ khoá SQL '%@'
zh_hans: 与 SQL 关键字 '%@' 冲突
zh_hant: 與 SQL 關鍵字「%@」衝突

source: There is no query to send yet.
fr: Il n'y a pas encore de requête à envoyer.

source: Begin, commit, or roll back a transaction on the connection's shared session. The transaction stays open across calls until committed or rolled back, and it is the same session the user's own tabs run on, so leave nothing open. Needs tools:write.
fr: Commencez, effectuez ou annulez une transaction sur la session partagée de la connexion. La transaction reste ouverte pendant toutes les appels jusqu'à ce qu'elle soit effectuée ou annulée, et c'est la même session sur laquelle fonctionnent les onglets personnels de l'utilisateur, donc ne laissez rien ouvert. Besoin d'outils : write.
ko: 연결의 공유 세션에서 트랜잭션을 시작, 커밋 또는 롤백합니다. 트랜잭션은 커밋되거나 롤백될 때까지 여러 호출에 걸쳐 열려 있으며, 사용자의 탭이 실행되는 것과 같은 세션이므로 열어 둔 채로 두지 마십시오. tools:write가 필요합니다.
tr: Bağlantının paylaşılan oturumunda bir işlemi başlatır, işler veya geri alır. İşlem, işlenene veya geri alınana kadar çağrılar arasında açık kalır ve kullanıcının kendi sekmelerinin çalıştığı oturumun aynısıdır, bu yüzden hiçbir şeyi açık bırakmayın. tools:write gerektirir.
vi: Bắt đầu, commit hoặc rollback một transaction trên phiên dùng chung của kết nối. Transaction vẫn mở qua nhiều lần gọi cho tới khi được commit hoặc rollback, và đó chính là phiên mà các tab của người dùng đang chạy, nên đừng để lại gì đang mở. Cần tools:write.
zh_hans: 在连接的共享会话上开始、提交或回滚事务。事务会跨调用保持打开，直到被提交或回滚，而且它和用户自己的标签页运行在同一个会话上，所以不要留下任何未结束的事务。需要 tools:write。
zh_hant: 在連線的共用工作階段上開始、提交或回復交易。交易會跨呼叫保持開啟，直到被提交或回復，而且它和使用者自己的標籤頁執行在同一個工作階段上，所以不要留下任何未結束的交易。需要 tools:write。

source: Put the row back
fr: Remplacez la rangée
ko: 행 되돌리기
tr: Satırı geri koy
vi: Đưa dòng trở lại
zh_hans: 把该行放回去
zh_hant: 把該列放回去

source: This copy ran inside the transaction already open on this connection. Commit it to keep the copy, or roll it back to discard it.
fr: Cette copie a été exécutée dans la transaction déjà ouverte sur cette connexion. Commettez-la pour conserver la copie, ou rétrogradez-la pour la rejeter.

source: iCloud account is not available. Sign in to iCloud in System Settings.
fr: Le compte iCloud n'est pas disponible. Connectez-vous à iCloud dans les paramètres système.
ko: iCloud 계정을 사용할 수 없습니다. 시스템 설정에서 iCloud에 로그인하십시오.
tr: iCloud hesabı kullanılamıyor. Sistem Ayarları'ndan iCloud'a giriş yapın.
vi: Tài khoản iCloud không khả dụng. Đăng nhập iCloud trong Cài đặt hệ thống.
zh_hans: iCloud 账户不可用。请在系统设置中登录 iCloud。
zh_hant: iCloud 帳號無法使用。請在「系統設定」中登入 iCloud。

source: Doubled Quote
fr: Citation doublée
ko: 큰따옴표 이중 처리
tr: Çiftlenmiş Tırnak
vi: Nháy kép lặp lại
zh_hans: 重复引号
zh_hant: 重複引號

source: Code folding
fr: Pliage du code
ko: 코드 접기
tr: Kod katlama
vi: Thu gọn mã
zh_hans: 代码折叠
zh_hant: 程式碼摺疊

source: Metric value
fr: Valeur métrique
ko: 지표 값
tr: Metrik değeri
vi: Giá trị chỉ số
zh_hans: 指标值
zh_hant: 指標值

source: Get Server Dashboard
fr: Obtenez le tableau de bord du serveur
ko: 서버 대시보드 가져오기
tr: Sunucu Panosunu Al
vi: Lấy bảng điều khiển máy chủ
zh_hans: 获取服务器仪表板
zh_hant: 取得伺服器儀表板

source: Unlock the Pro features
fr: Déverrouiller les fonctionnalités Pro
ko: Pro 기능 잠금 해제
tr: Pro özelliklerinin kilidini açın
vi: Mở khóa các tính năng Pro
zh_hans: 解锁 Pro 功能
zh_hant: 解鎖 Pro 功能

source: Maximum rows per export. Defaults to the server's configured row limit.
fr: Nombre maximum de lignes par exportation. Par défaut, il correspond au limite de lignes configuré par le serveur.
ko: 내보내기당 최대 행 수입니다. 기본값은 서버에 설정된 행 제한입니다.
tr: Dışa aktarma başına en fazla satır. Varsayılan olarak sunucunun yapılandırılmış satır sınırıdır.
vi: Số dòng tối đa cho mỗi lần xuất. Mặc định là giới hạn dòng được cấu hình trên máy chủ.
zh_hans: 每次导出的最大行数。默认为服务器配置的行数上限。
zh_hant: 每次匯出的最大列數。預設為伺服器設定的列數上限。

source: Match All
fr: Correspondre à tout
ko: 모두 일치
tr: Tümü Eşleşsin
vi: Khớp tất cả
zh_hans: 匹配全部
zh_hant: 符合全部

source: Schema
fr: Schéma
ko: 스키마
tr: Şema
zh_hant: 綱要

source: All rights reserved.
fr: Tous droits réservés.
ko: 모든 권리 보유.
tr: Tüm hakları saklıdır.
vi: Đã đăng ký bản quyền.
zh_hans: 保留所有权利。
zh_hant: 保留所有權利。

source: Ignore leading and trailing whitespace
fr: Ignorer les espaces blancs avant et après

source: Return the SELECT statement a view is defined by.
fr: Renvoie la déclaration SELECT par laquelle une vue est définie.
ko: 뷰를 정의하는 SELECT 명령문을 반환합니다.
tr: Bir görünümü tanımlayan SELECT ifadesini döndürür.
vi: Trả về câu lệnh SELECT định nghĩa một view.
zh_hans: 返回定义某个视图的 SELECT 语句。
zh_hant: 回傳定義某個檢視表的 SELECT 陳述式。

source: Right-click to show all tables
fr: Cliquez avec le bouton droit de la souris pour afficher toutes les tables.
ko: 마우스 오른쪽 버튼을 클릭하여 모든 테이블 표시
vi: Nhấn chuột phải để hiện tất cả bảng
zh_hans: 右键单击显示所有表
zh_hant: 按右鍵顯示所有資料表

source: Microsoft Entra ID
fr: Identifiant Microsoft Entra

source: SAVED CONNECTIONS
fr: CONNECTIONS ENSAVÉES
ko: 저장된 연결
tr: KAYITLI BAĞLANTILAR
vi: KẾT NỐI ĐÃ LƯU
zh_hans: 已保存的连接
zh_hant: 已儲存的連線

source: Ignore Case
fr: Ignorer la casse
ko: 대소문자 무시
tr: Büyük/Küçük Harf Duyarsız
vi: Bỏ qua hoa thường
zh_hans: 忽略大小写
zh_hant: 忽略大小寫

source: Opens an AWS Systems Manager port forwarding session through a target instance.
fr: Ouvre une session de redirection de port AWS Systems Manager via une instance cible.

source: Suspended
fr: Suspension
ko: 일시 중단됨
vi: Tạm ngưng
zh_hans: 已暂停
zh_hant: 已暫停

source: Authenticate to execute database operations
fr: Authentifiez-vous pour exécuter des opérations de base de données.
ko: 데이터베이스 작업을 실행하려면 인증하십시오
tr: Veritabanı işlemlerini çalıştırmak için kimlik doğrulayın
vi: Xác thực để thực thi thao tác cơ sở dữ liệu
zh_hans: 验证身份以执行数据库操作
zh_hant: 驗證身分以執行資料庫操作

source: Current schema: %@ (read-only, ⌘K to switch)
fr: Schéma actuel : %@ (en lecture seule, ⌘K pour basculer)
ko: 현재 스키마: %@ (읽기 전용, 전환하려면 ⌘K)
tr: Mevcut şema: %@ (salt okunur, değiştirmek için ⌘K)
vi: Schema hiện tại: %@ (chỉ đọc, ⌘K để chuyển)
zh_hans: 当前 schema：%@（只读，⌘K 切换）
zh_hant: 目前的綱要：%@（唯讀，⌘K 切換）

source: Critical cost
fr: Coût critique
ko: 심각한 비용
tr: Kritik maliyet
vi: Chi phí nghiêm trọng
zh_hans: 严重成本
zh_hant: 嚴重成本
